IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0g1x0x_g3x0x/CANFD0_1.0.xml
        <register id="CANFD0_MCAN_TOCV" width="32" offset="0x2C" description="MCAN Timeout Counter Value">
            <bitfield id="TOC" description="Timeout Counter. The Timeout Counter is decremented in multiples of CAN bit times, (1...16), depending on the configuration of TSCC.TCP. When decremented to zero, interrupt flag IR.TOO is set and the Timeout Counter is stopped. Start and reset/restart conditions are configured via TOCC.TOS." begin="15" end="0" width="16" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_ECR" width="32" offset="0x40" description="MCAN Error Counter Register">
            <bitfield id="TEC" description="Transmit Error Counter. Actual state of the Transmit Error Counter, values between 0 and 255.
 
Note: When CCCR.ASM is set, the CAN protocol controller does not increment TEC and REC when a CAN protocol error is detected, but CEL is still incremented." begin="7" end="0" width="8" rwaccess="R">
            </bitfield>
            <bitfield id="REC" description="Receive Error Counter. Actual state of the Receive Error Counter, values between 0 and 127.
 
Note: When CCCR.ASM is set, the CAN protocol controller does not increment TEC and REC when a CAN protocol error is detected, but CEL is still incremented." begin="14" end="8" width="7" rwaccess="R">
            </bitfield>
            <bitfield id="RP" description="Receive Error Passive
  0  The Receive Error Counter is below the error passive level of 128
  1  The Receive Error Counter has reached the error passive level of 128" begin="15" end="15" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CEL" description="CAN Error Logging. The counter is incremented each time when a CAN protocol error causes the Transmit Error Counter or the Receive Error Counter to be incremented. It is reset by read access to CEL. The counter stops at 0xFF; the next increment of TEC or REC sets interrupt flag IR.ELO.
 
Note: When CCCR.ASM is set, the CAN protocol controller does not increment TEC and REC when a CAN protocol error is detected, but CEL is still incremented." begin="23" end="16" width="8" rwaccess="R">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_PSR" width="32" offset="0x44" description="MCAN Protocol Status Register">
            <bitfield id="LEC" description="Last Error Code. The LEC indicates the type of the last error to occur on the CAN bus. This field will be cleared to '0' when a message has been transferred (reception or transmission) without error.
  0  No Error: No error occurred since LEC has been reset by successful reception or transmission.
  1  Stuff Error: More than 5 equal bits in a sequence have occurred in a part of a received message where this is not allowed.
  2  Form Error: A fixed format part of a received frame has the wrong format.
  3  AckError: The message transmitted by the MCAN was not acknowledged by another node.
  4  Bit1Error: During the transmission of a message (with the exception of the arbitration field), the device wanted to send a recessive level (bit of logical value '1'), but the monitored bus value was dominant.
  5  Bit0Error: During the transmission of a message (or acknowledge bit, or active error flag, or overload flag), the device wanted to send a dominant level (data or identifier bit logical value '0'), but the monitored bus value was recessive. During Bus_Off recovery this status is set each time a sequence of 11 recessive bits has been monitored. This enables the CPU to monitor the proceeding of the Bus_Off recovery sequence (indicating the bus is not stuck at dominant or continuously disturbed).
  6  CRCError: The CRC check sum of a received message was incorrect. The CRC of an incoming message does not match with the CRC calculated from the received data.
  7  NoChange: Any read access to the Protocol Status Register re-initializes the LEC to '7'. When the LEC shows the value '7', no CAN bus event was detected since the last CPU read access to the Protocol Status Register.
 
Note: When a frame in CAN FD format has reached the data phase with BRS flag set, the next CAN event (error or valid frame) will be shown in DLEC instead of LEC. An error in a fixed stuff bit of a CAN FD CRC sequence will be shown as a Form Error, not Stuff Error. Note: The Bus_Off recovery sequence (see ISO 11898-1:2015) cannot be shortened by setting or resetting CCCR.INIT. If the device goes Bus_Off, it will set CCCR.INIT of its own accord, stopping all bus activities. Once CCCR.INIT has been cleared by the CPU, the device will then wait for 129 occurrences of Bus Idle (129 * 11 consecutive recessive bits) before resuming normal operation. At the end of the Bus_Off recovery sequence, the Error Management Counters will be reset. During the waiting time after the resetting of CCCR.INIT, each time a sequence of 11 recessive bits has been monitored, a Bit0Error code is written to PSR.LEC, enabling the CPU to readily check up whether the CAN bus is stuck at dominant or continuously disturbed and to monitor the Bus_Off recovery sequence. ECR.REC is used to count these sequences." begin="2" end="0" width="3" rwaccess="R">
            </bitfield>
            <bitfield id="ACT" description="Node Activity.  Monitors the module's CAN communication state.
  00  Synchronizing - node is synchronizing on CAN communication
  01  Idle - node is neither receiver nor transmitter
  10  Receiver - node is operating as receiver
  11  Transmitter - node is operating as transmitter
 
Note: ACT is set to &amp;quot;00&amp;quot; by a Protocol Exception Event." begin="4" end="3" width="2" rwaccess="R">
            </bitfield>
            <bitfield id="EP" description="Error Passive
  0  The M_CAN is in the Error_Active state. It normally takes part in bus communication and sends an active error flag when an error has been detected
  1  The M_CAN is in the Error_Passive state" begin="5" end="5" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="EW" description="Warning Status
  0  Both error counters are below the Error_Warning limit of 96
  1  At least one of error counter has reached the Error_Warning limit of 96" begin="6" end="6" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="BO" description="Bus_Off Status
  0  The M_CAN is not Bus_Off
  1  The M_CAN is in Bus_Off state" begin="7" end="7" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="DLEC" description="Data Phase Last Error Code. Type of last error that occurred in the data phase of a CAN FD format frame with its BRS flag set. Coding is the same as for LEC. This field will be cleared to zero when a CAN FD format frame with its BRS flag set has been transferred (reception or transmission) without error." begin="10" end="8" width="3" rwaccess="R">
            </bitfield>
            <bitfield id="RESI" description="ESI Flag of Last Received CAN FD Message. This bit is set together with RFDF, independent of acceptance filtering.
  0  Last received CAN FD message did not have its ESI flag set
  1  Last received CAN FD message had its ESI flag set" begin="11" end="11" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="RBRS" description="BRS Flag of Last Received CAN FD Message. This bit is set together with RFDF, independent of acceptance filtering.
  0  Last received CAN FD message did not have its BRS flag set
  1  Last received CAN FD message had its BRS flag set" begin="12" end="12" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="RFDF" description="Received a CAN FD Message.  This bit is set independent of acceptance filtering.
  0  Since this bit was reset by the CPU, no CAN FD message has been received
  1  Message in CAN FD format with FDF flag set has been received" begin="13" end="13" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="PXE" description="Protocol Exception Event
  0  No protocol exception event occurred since last read access
  1  Protocol exception event occurred" begin="14" end="14" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TDCV" description="Transmitter Delay Compensation Value. Position of the secondary sample point, defined by the sum of the measured delay from the internal CAN TX signal to the internal CAN RX signal and TDCR.TDCO. The SSP position is, in the data phase, the number of mtq between the start of the transmitted bit and the secondary sample point. Valid values are 0 to 127 mtq." begin="22" end="16" width="7" rwaccess="R">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_TDCR" width="32" offset="0x48" description="MCAN Transmitter Delay Compensation Register">
            <bitfield id="TDCF" description="Transmitter Delay Compensation Filter Window Length. Defines the minimum value for the SSP position, dominant edges on the internal CAN RX signal that would result in an earlier SSP position are ignored for transmitter delay measurement. The feature is enabled when TDCF is configured to a value greater than TDCO. Valid values are 0 to 127 mtq.
 
