IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0g1x0x_g3x0x/CANFD0_1.0.xml
        <register id="CANFD0_MCAN_RXF0C" width="32" offset="0xA0" description="MCAN Rx FIFO 0 Configuration">
            <bitfield id="F0SA" description="Rx FIFO 0 Start Address. Start address of Rx FIFO 0 in Message RAM (32-bit word address).
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="15" end="2" width="14" rwaccess="R/W">
            </bitfield>
            <bitfield id="F0S" description="Rx FIFO 0 Size. The Rx FIFO 0 elements are indexed from 0 to F0S-1.
  0      No Rx FIFO 0
  1-64  Number of Rx FIFO 0 elements
  &gt;64   Values greater than 64 are interpreted as 64
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="22" end="16" width="7" rwaccess="R/W">
            </bitfield>
            <bitfield id="F0WM" description="Rx FIFO 0 Watermark
  0      Watermark interrupt disabled
  1-64  Level for Rx FIFO 0 watermark interrupt (IR.RF0W)
  &gt;64   Watermark interrupt disabled
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="30" end="24" width="7" rwaccess="R/W">
            </bitfield>
            <bitfield id="F0OM" description="FIFO 0 Operation Mode. FIFO 0 can be operated in blocking or in overwrite mode.
  0  FIFO 0 blocking mode
  1  FIFO 0 overwrite mode
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="31" end="31" width="1" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_RXF0S" width="32" offset="0xA4" description="MCAN Rx FIFO 0 Status">
            <bitfield id="F0FL" description="Rx FIFO 0 Fill Level. Number of elements stored in Rx FIFO 0, range 0 to 64." begin="6" end="0" width="7" rwaccess="R">
            </bitfield>
            <bitfield id="F0GI" description="Rx FIFO 0 Get Index. Rx FIFO 0 read index pointer, range 0 to 63." begin="13" end="8" width="6" rwaccess="R">
            </bitfield>
            <bitfield id="F0PI" description="Rx FIFO 0 Put Index. Rx FIFO 0 write index pointer, range 0 to 63." begin="21" end="16" width="6" rwaccess="R">
            </bitfield>
            <bitfield id="F0F" description="Rx FIFO 0 Full
  0  Rx FIFO 0 not full
  1  Rx FIFO 0 full" begin="24" end="24" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="RF0L" description="Rx FIFO 0 Message Lost. This bit is a copy of interrupt flag IR.RF0L. When IR.RF0L is reset, this bit is also reset.
  0  No Rx FIFO 0 message lost
  1  Rx FIFO 0 message lost, also set after write attempt to Rx FIFO 0 of size zero
 
Note: Overwriting the oldest message when RXF0C.F0OM = '1' will not set this flag." begin="25" end="25" width="1" rwaccess="R">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_RXF0A" width="32" offset="0xA8" description="MCAN Rx FIFO 0 Acknowledge">
            <bitfield id="F0AI" description="Rx FIFO 0 Acknowledge Index. After the Host has read a message or a sequence of messages from Rx FIFO 0 it has to write the buffer index of the last element read from Rx FIFO 0 to F0AI. This will set the Rx FIFO 0 Get Index RXF0S.F0GI to F0AI + 1 and update the FIFO 0 Fill Level RXF0S.F0FL." begin="5" end="0" width="6" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_RXBC" width="32" offset="0xAC" description="MCAN Rx Buffer Configuration">
            <bitfield id="RBSA" description="Rx Buffer Start Address. Configures the start address of the Rx Buffers section in the Message RAM (32-bit word address).
 
+I466" begin="15" end="2" width="14" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_RXF1C" width="32" offset="0xB0" description="MCAN Rx FIFO 1 Configuration">
            <bitfield id="F1SA" description="Rx FIFO 1 Start Address Start address of Rx FIFO 1 in Message RAM (32-bit word address)." begin="15" end="2" width="14" rwaccess="R/W">
            </bitfield>
            <bitfield id="F1S" description="Rx FIFO 1 Size. The Rx FIFO 1 elements are indexed from 0 to F1S - 1.
  0      No Rx FIFO 1
  1-64  Number of Rx FIFO 1 elements
  &gt;64   Values greater than 64 are interpreted as 64
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="22" end="16" width="7" rwaccess="R/W">
            </bitfield>
            <bitfield id="F1WM" description="Rx FIFO 1 Watermark
  0      Watermark interrupt disabled
  1-64  Level for Rx FIFO 1 watermark interrupt (IR.RF1W)
  &gt;64   Watermark interrupt disabled
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="30" end="24" width="7" rwaccess="R/W">
            </bitfield>
            <bitfield id="F1OM" description="FIFO 1 Operation Mode. FIFO 1 can be operated in blocking or in overwrite mode.
  0  FIFO 1 blocking mode
  1  FIFO 1 overwrite mode
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="31" end="31" width="1" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_RXF1S" width="32" offset="0xB4" description="MCAN Rx FIFO 1 Status">
            <bitfield id="F1FL" description="Rx FIFO 1 Fill Level. Number of elements stored in Rx FIFO 1, range 0 to 64." begin="6" end="0" width="7" rwaccess="R">
            </bitfield>
            <bitfield id="F1GI" description="Rx FIFO 1 Get Index. Rx FIFO 1 read index pointer, range 0 to 63." begin="13" end="8" width="6" rwaccess="R">
            </bitfield>
            <bitfield id="F1PI" description="Rx FIFO 1 Put Index. Rx FIFO 1 write index pointer, range 0 to 63." begin="21" end="16" width="6" rwaccess="R">
            </bitfield>
            <bitfield id="F1F" description="Rx FIFO 1 Full
  0  Rx FIFO 1 not full
  1  Rx FIFO 1 full" begin="24" end="24" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="RF1L" description="Rx FIFO 1 Message Lost. This bit is a copy of interrupt flag IR.RF1L. When IR.RF1L is reset, this bit is also reset.
  0  No Rx FIFO 1 message lost
  1  Rx FIFO 1 message lost, also set after write attempt to Rx FIFO 1 of size zero
 
Note: Overwriting the oldest message when RXF1C.F1OM = '1' will not set this flag." begin="25" end="25" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="DMS" description="Debug Message Status
  00  Idle state, wait for reception of debug messages
  01  Debug message A received
  10  Debug messages A, B received
  11  Debug messages A, B, C received" begin="31" end="30" width="2" rwaccess="R">
            </bitfield>
        </register>
