IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0g1x0x_g3x0x/CANFD0_1.0.xml
        <register id="CANFD0_MCAN_RXF1A" width="32" offset="0xB8" description="MCAN Rx FIFO 1 Acknowledge">
            <bitfield id="F1AI" description="Rx FIFO 1 Acknowledge Index. After the Host has read a message or a sequence of messages from Rx FIFO 1 it has to write the buffer index of the last element read from Rx FIFO 1 to F1AI. This will set the Rx FIFO 1 Get Index RXF1S.F1GI to F1AI + 1 and update the FIFO 1 Fill Level RXF1S.F1FL." begin="5" end="0" width="6" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_RXESC" width="32" offset="0xBC" description="MCAN Rx Buffer / FIFO Element Size Configuration">
            <bitfield id="F0DS" description="Rx FIFO 0 Data Field Size
  000  8 byte data field
  001  12 byte data field
  010  16 byte data field
  011  20 byte data field
  100  24 byte data field
  101  32 byte data field
  110  48 byte data field
  111  64 byte data field
 
Note: In case the data field size of an accepted CAN frame exceeds the data field size configured for the matching Rx Buffer or Rx FIFO, only the number of bytes as configured by RXESC are stored to the Rx Buffer resp. Rx FIFO element. The rest of the frame's data field is ignored.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="2" end="0" width="3" rwaccess="R/W">
            </bitfield>
            <bitfield id="F1DS" description="Rx FIFO 1 Data Field Size
  000  8 byte data field
  001  12 byte data field
  010  16 byte data field
  011  20 byte data field
  100  24 byte data field
  101  32 byte data field
  110  48 byte data field
  111  64 byte data field
 
Note: In case the data field size of an accepted CAN frame exceeds the data field size configured for the matching Rx Buffer or Rx FIFO, only the number of bytes as configured by RXESC are stored to the Rx Buffer resp. Rx FIFO element. The rest of the frame's data field is ignored.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="6" end="4" width="3" rwaccess="R/W">
            </bitfield>
            <bitfield id="RBDS" description="Rx Buffer Data Field Size
  000  8 byte data field
  001  12 byte data field
  010  16 byte data field
  011  20 byte data field
  100  24 byte data field
  101  32 byte data field
  110  48 byte data field
  111  64 byte data field
 
Note: In case the data field size of an accepted CAN frame exceeds the data field size configured for the matching Rx Buffer or Rx FIFO, only the number of bytes as configured by RXESC are stored to the Rx Buffer resp. Rx FIFO element. The rest of the frame's data field is ignored.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="10" end="8" width="3" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_TXBC" width="32" offset="0xC0" description="MCAN Tx Buffer Configuration">
            <bitfield id="TBSA" description="Tx Buffers Start Address. Start address of Tx Buffers section in Message RAM (32-bit word address).
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="15" end="2" width="14" rwaccess="R/W">
            </bitfield>
            <bitfield id="NDTB" description="Number of Dedicated Transmit Buffers
  0      No Dedicated Tx Buffers
  1-32  Number of Dedicated Tx Buffers
  &gt;32   Values greater than 32 are interpreted as 32
 
Note: Be aware that the sum of TFQS and NDTB may be not greater than 32. There is no check
for erroneous configurations. The Tx Buffers section in the Message RAM starts with the
dedicated Tx Buffers.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="21" end="16" width="6" rwaccess="R/W">
            </bitfield>
            <bitfield id="TFQS" description="Transmit FIFO/Queue Size
  0      No Tx FIFO/Queue
  1-32  Number of Tx Buffers used for Tx FIFO/Queue
  &gt;32   Values greater than 32 are interpreted as 32
 
Note: Be aware that the sum of TFQS and NDTB may be not greater than 32. There is no check
for erroneous configurations. The Tx Buffers section in the Message RAM starts with the
dedicated Tx Buffers.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="29" end="24" width="6" rwaccess="R/W">
            </bitfield>
            <bitfield id="TFQM" description="Tx FIFO/Queue Mode
  0  Tx FIFO operation
  1  Tx Queue operation
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="30" end="30" width="1" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_TXFQS" width="32" offset="0xC4" description="MCAN Tx FIFO / Queue Status">
            <bitfield id="TFFL" description="Tx FIFO Free Level.  Number of consecutive free Tx FIFO elements starting from TFGI, range 0 to 32. Read as zero when Tx Queue operation is configured (TXBC.TFQM = '1')." begin="5" end="0" width="6" rwaccess="R">
            </bitfield>
            <bitfield id="TFGI" description="Tx FIFO Get Index. Tx FIFO read index pointer, range 0 to 31. Read as zero when Tx Queue operation is configured (TXBC.TFQM = '1').
 
Note: In case of mixed configurations where dedicated Tx Buffers are combined with a Tx FIFO or a Tx Queue, the Put and Get Indices indicate the number of the Tx Buffer starting with the first dedicated Tx Buffers. Example: For a configuration of 12 dedicated Tx Buffers and a Tx FIFO of 20 Buffers a Put Index of 15 points to the fourth buffer of the Tx FIFO." begin="12" end="8" width="5" rwaccess="R">
            </bitfield>
            <bitfield id="TFQP" description="Tx FIFO/Queue Put Index. Tx FIFO/Queue write index pointer, range 0 to 31.
 
Note: In case of mixed configurations where dedicated Tx Buffers are combined with a Tx FIFO or a Tx Queue, the Put and Get Indices indicate the number of the Tx Buffer starting with the first dedicated Tx Buffers. Example: For a configuration of 12 dedicated Tx Buffers and a Tx FIFO of 20 Buffers a Put Index of 15 points to the fourth buffer of the Tx FIFO." begin="20" end="16" width="5" rwaccess="R">
            </bitfield>
            <bitfield id="TFQF" description="Tx FIFO/Queue Full
  0  Tx FIFO/Queue not full
  1  Tx FIFO/Queue full" begin="21" end="21" width="1" rwaccess="R">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_TXESC" width="32" offset="0xC8" description="MCAN Tx Buffer Element Size Configuration">
            <bitfield id="TBDS" description="Tx Buffer Data Field Size
  000  8 byte data field
  001  12 byte data field
  010  16 byte data field
  011  20 byte data field
  100  24 byte data field
  101  32 byte data field
  110  48 byte data field
  111  64 byte data field
 
Note: In case the data length code DLC of a Tx Buffer element is configured to a value higher than the Tx Buffer data field size TXESC.TBDS, the bytes not defined by the Tx Buffer are transmitted as &amp;quot;0xCC&amp;quot; (padding bytes).
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="2" end="0" width="3" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_TXBRP" width="32" offset="0xCC" description="MCAN Tx Buffer Request Pending">
            <bitfield id="TRP0" description="Transmission Request Pending 0.
 
Each Tx Buffer has its own Transmission Request Pending bit. The bits are set via register TXBAR. The bits are reset after a requested transmission has completed or has been cancelled via register TXBCR.
 
