IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0g1x0x_g3x0x/CANFD0_1.0.xml
TXBRP bits are set only for those Tx Buffers configured via TXBC. After a TXBRP bit has been set, a Tx scan is started to check for the pending Tx request with the highest priority (Tx Buffer with lowest Message ID).
 
A cancellation request resets the corresponding transmission request pending bit of register TXBRP. In case a transmission has already been started when a cancellation is requested, this is done at the end of the transmission, regardless whether the transmission was successful or not. The cancellation request bits are reset directly after the corresponding TXBRP bit has been reset.
 
After a cancellation has been requested, a finished cancellation is signalled via TXBCF
- after successful transmission together with the corresponding TXBTO bit
- when the transmission has not yet been started at the point of cancellation
- when the transmission has been aborted due to lost arbitration
- when an error occurred during frame transmission
 
In DAR mode all transmissions are automatically cancelled if they are not successful. The corresponding TXBCF bit is set for all unsuccessful transmissions.
  0  No transmission request pending
  1  Transmission request pending
 
Note: TXBRP bits which are set while a Tx scan is in progress are not considered during this particular Tx scan. In case a cancellation is requested for such a Tx Buffer, this Add Request is cancelled immediately, the corresponding TXBRP bit is reset." begin="0" end="0" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP1" description="Transmission Request Pending 1. See description for bit 0." begin="1" end="1" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP2" description="Transmission Request Pending 2. See description for bit 0." begin="2" end="2" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP3" description="Transmission Request Pending 3. See description for bit 0." begin="3" end="3" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP4" description="Transmission Request Pending 4. See description for bit 0." begin="4" end="4" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP5" description="Transmission Request Pending 5. See description for bit 0." begin="5" end="5" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP6" description="Transmission Request Pending 6. See description for bit 0." begin="6" end="6" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP7" description="Transmission Request Pending 7. See description for bit 0." begin="7" end="7" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP8" description="Transmission Request Pending 8. See description for bit 0." begin="8" end="8" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP9" description="Transmission Request Pending 9. See description for bit 0." begin="9" end="9" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP10" description="Transmission Request Pending 10. See description for bit 0." begin="10" end="10" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP11" description="Transmission Request Pending 11. See description for bit 0." begin="11" end="11" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP12" description="Transmission Request Pending 12. See description for bit 0." begin="12" end="12" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP13" description="Transmission Request Pending 13. See description for bit 0." begin="13" end="13" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP14" description="Transmission Request Pending 14. See description for bit 0." begin="14" end="14" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP15" description="Transmission Request Pending 15. See description for bit 0." begin="15" end="15" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP16" description="Transmission Request Pending 16. See description for bit 0." begin="16" end="16" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP17" description="Transmission Request Pending 17. See description for bit 0." begin="17" end="17" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP18" description="Transmission Request Pending 18. See description for bit 0." begin="18" end="18" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP19" description="Transmission Request Pending 19. See description for bit 0." begin="19" end="19" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP20" description="Transmission Request Pending 20. See description for bit 0." begin="20" end="20" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP21" description="Transmission Request Pending 21. See description for bit 0." begin="21" end="21" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP22" description="Transmission Request Pending 22. See description for bit 0." begin="22" end="22" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP23" description="Transmission Request Pending 23. See description for bit 0." begin="23" end="23" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP24" description="Transmission Request Pending 24. See description for bit 0." begin="24" end="24" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP25" description="Transmission Request Pending 25. See description for bit 0." begin="25" end="25" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP26" description="Transmission Request Pending 26. See description for bit 0." begin="26" end="26" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP27" description="Transmission Request Pending 27. See description for bit 0." begin="27" end="27" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP28" description="Transmission Request Pending 28. See description for bit 0." begin="28" end="28" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP29" description="Transmission Request Pending 29. See description for bit 0." begin="29" end="29" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP30" description="Transmission Request Pending 30. See description for bit 0." begin="30" end="30" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP31" description="Transmission Request Pending 31. See description for bit 0." begin="31" end="31" width="1" rwaccess="R">
            </bitfield>
        </register>
