IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0g1x0x_g3x0x/CANFD0_1.0.xml
        <register id="CANFD0_MCAN_TXBTIE" width="32" offset="0xE0" description="MCAN Tx Buffer Transmission Interrupt Enable">
            <bitfield id="TIE0" description="Transmission Interrupt Enable 0. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="0" end="0" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE1" description="Transmission Interrupt Enable 1. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="1" end="1" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE2" description="Transmission Interrupt Enable 2. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="2" end="2" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE3" description="Transmission Interrupt Enable 3. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="3" end="3" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE4" description="Transmission Interrupt Enable 4. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="4" end="4" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE5" description="Transmission Interrupt Enable 5. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="5" end="5" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE6" description="Transmission Interrupt Enable 6. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="6" end="6" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE7" description="Transmission Interrupt Enable 7. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="7" end="7" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE8" description="Transmission Interrupt Enable 8. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="8" end="8" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE9" description="Transmission Interrupt Enable 9. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="9" end="9" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE10" description="Transmission Interrupt Enable 10. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="10" end="10" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE11" description="Transmission Interrupt Enable 11. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="11" end="11" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE12" description="Transmission Interrupt Enable 12. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="12" end="12" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE13" description="Transmission Interrupt Enable 13. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="13" end="13" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE14" description="Transmission Interrupt Enable 14. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="14" end="14" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE15" description="Transmission Interrupt Enable 15. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="15" end="15" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE16" description="Transmission Interrupt Enable 16. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="16" end="16" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE17" description="Transmission Interrupt Enable 17. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="17" end="17" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE18" description="Transmission Interrupt Enable 18. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="18" end="18" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE19" description="Transmission Interrupt Enable 19. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="19" end="19" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE20" description="Transmission Interrupt Enable 20. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="20" end="20" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE21" description="Transmission Interrupt Enable 21. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="21" end="21" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE22" description="Transmission Interrupt Enable 22. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="22" end="22" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE23" description="Transmission Interrupt Enable 23. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="23" end="23" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE24" description="Transmission Interrupt Enable 24. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="24" end="24" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE25" description="Transmission Interrupt Enable 25. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="25" end="25" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE26" description="Transmission Interrupt Enable 26. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="26" end="26" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE27" description="Transmission Interrupt Enable 27. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="27" end="27" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE28" description="Transmission Interrupt Enable 28. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="28" end="28" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE29" description="Transmission Interrupt Enable 29. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="29" end="29" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE30" description="Transmission Interrupt Enable 30. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="30" end="30" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TIE31" description="Transmission Interrupt Enable 31. Each Tx Buffer has its own Transmission Interrupt Enable bit.
  0  Transmission interrupt disabled
  1  Transmission interrupt enable" begin="31" end="31" width="1" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_TXBCIE" width="32" offset="0xE4" description="MCAN Tx Buffer Cancellation Finished Interrupt Enable">
            <bitfield id="CFIE0" description="Cancellation Finished Interrupt Enable 0. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="0" end="0" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE1" description="Cancellation Finished Interrupt Enable 1. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="1" end="1" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE2" description="Cancellation Finished Interrupt Enable 2. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="2" end="2" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE3" description="Cancellation Finished Interrupt Enable 3. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="3" end="3" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE4" description="Cancellation Finished Interrupt Enable 4. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="4" end="4" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE5" description="Cancellation Finished Interrupt Enable 5. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="5" end="5" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE6" description="Cancellation Finished Interrupt Enable 6. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="6" end="6" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE7" description="Cancellation Finished Interrupt Enable 7. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="7" end="7" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE8" description="Cancellation Finished Interrupt Enable 8. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="8" end="8" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE9" description="Cancellation Finished Interrupt Enable 9. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="9" end="9" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE10" description="Cancellation Finished Interrupt Enable 10. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="10" end="10" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE11" description="Cancellation Finished Interrupt Enable 11. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="11" end="11" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE12" description="Cancellation Finished Interrupt Enable 12. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="12" end="12" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE13" description="Cancellation Finished Interrupt Enable 13. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="13" end="13" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE14" description="Cancellation Finished Interrupt Enable 14. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="14" end="14" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE15" description="Cancellation Finished Interrupt Enable 15. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="15" end="15" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE16" description="Cancellation Finished Interrupt Enable 16. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="16" end="16" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE17" description="Cancellation Finished Interrupt Enable 17. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="17" end="17" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE18" description="Cancellation Finished Interrupt Enable 18. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="18" end="18" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE19" description="Cancellation Finished Interrupt Enable 19. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="19" end="19" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE20" description="Cancellation Finished Interrupt Enable 20. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="20" end="20" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE21" description="Cancellation Finished Interrupt Enable 21. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="21" end="21" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE22" description="Cancellation Finished Interrupt Enable 22. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="22" end="22" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE23" description="Cancellation Finished Interrupt Enable 23. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="23" end="23" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE24" description="Cancellation Finished Interrupt Enable 24. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="24" end="24" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE25" description="Cancellation Finished Interrupt Enable 25. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="25" end="25" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE26" description="Cancellation Finished Interrupt Enable 26. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="26" end="26" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE27" description="Cancellation Finished Interrupt Enable 27. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="27" end="27" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE28" description="Cancellation Finished Interrupt Enable 28. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="28" end="28" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE29" description="Cancellation Finished Interrupt Enable 29. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="29" end="29" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE30" description="Cancellation Finished Interrupt Enable 30. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="30" end="30" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CFIE31" description="Cancellation Finished Interrupt Enable 31. Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
  0  Cancellation finished interrupt disabled
  1  Cancellation finished interrupt enabled" begin="31" end="31" width="1" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_TXEFC" width="32" offset="0xF0" description="MCAN Tx Event FIFO Configuration">
            <bitfield id="EFSA" description="Event FIFO Start Address. Start address of Tx Event FIFO in Message RAM (32-bit word address)." begin="15" end="2" width="14" rwaccess="R/W">
            </bitfield>
            <bitfield id="EFS" description="Event FIFO Size. The Tx Event FIFO elements are indexed from 0 to EFS - 1.
  0      Tx Event FIFO disabled
  1-32  Number of Tx Event FIFO elements
  &gt;32   Values greater than 32 are interpreted as 32" begin="21" end="16" width="6" rwaccess="R/W">
            </bitfield>
            <bitfield id="EFWM" description="Event FIFO Watermark
  0      Watermark interrupt disabled
  1-32  Level for Tx Event FIFO watermark interrupt (IR.TEFW)
  &gt;32   Watermark interrupt disabled" begin="29" end="24" width="6" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_TXEFS" width="32" offset="0xF4" description="MCAN Tx Event FIFO Status">
            <bitfield id="EFFL" description="Event FIFO Fill Level. Number of elements stored in Tx Event FIFO, range 0 to 32." begin="5" end="0" width="6" rwaccess="R">
            </bitfield>
            <bitfield id="EFGI" description="Event FIFO Get Index. Tx Event FIFO read index pointer, range 0 to 31." begin="12" end="8" width="5" rwaccess="R">
            </bitfield>
            <bitfield id="EFPI" description="Event FIFO Put Index.Tx Event FIFO write index pointer, range 0 to 31." begin="20" end="16" width="5" rwaccess="R">
            </bitfield>
            <bitfield id="EFF" description="Event FIFO Full
  0  Tx Event FIFO not full
  1  Tx Event FIFO full" begin="24" end="24" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TEFL" description="Tx Event FIFO Element Lost. This bit is a copy of interrupt flag IR.TEFL. When IR.TEFL is reset, this bit is also reset.
  0  No Tx Event FIFO element lost
  1  Tx Event FIFO element lost, also set after write attempt to Tx Event FIFO of size zero." begin="25" end="25" width="1" rwaccess="R">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_TXEFA" width="32" offset="0xF8" description="MCAN Tx Event FIFO Acknowledge">
            <bitfield id="EFAI" description="Event FIFO Acknowledge Index. After the Host has read an element or a sequence of elements from the Tx Event FIFO it has to write the index of the last element read from Tx Event FIFO to EFAI. This will set the Tx Event FIFO Get Index TXEFS.EFGI to EFAI + 1 and update the Event FIFO Fill Level TXEFS.EFFL." begin="4" end="0" width="5" rwaccess="R/W">
            </bitfield>
        </register>
