IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0g1x0x_g3x0x/CANFD0_1.0.xml
    </group>
    <group id="CANFD0_TI_WRAPPER" name="CANFD0_TI_WRAPPER" instances="1" offset="0x7200" instaddr="0xA00" description="">
        <group id="CANFD0_PROCESSORS" name="CANFD0_PROCESSORS" instances="1" offset="0x0" instaddr="0x600" description="">
            <group id="CANFD0_MCANSS_REGS" name="CANFD0_MCANSS_REGS" instances="1" offset="0x0" instaddr="0x2C" description="">
                <register id="CANFD0_MCANSS_PID" width="32" offset="0x0" description="MCAN Subsystem Revision Register">
                    <bitfield id="MINOR" description="Minor Revision of the MCAN Subsystem" begin="5" end="0" width="6" rwaccess="R">
                    </bitfield>
                    <bitfield id="MAJOR" description="Major Revision of the MCAN Subsystem" begin="10" end="8" width="3" rwaccess="R">
                    </bitfield>
                    <bitfield id="MODULE_ID" description="Module Identification Number" begin="27" end="16" width="12" rwaccess="R">
                    </bitfield>
                    <bitfield id="SCHEME" description="PID Register Scheme" begin="31" end="30" width="2" rwaccess="R">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANSS_CTRL" width="32" offset="0x4" description="MCAN Subsystem Control Register">
                    <bitfield id="DBGSUSP_FREE" description="Debug Suspend Free Bit. Enables debug suspend.
  0  Disable debug suspend
  1  Enable debug suspend" begin="3" end="3" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="WAKEUPREQEN" description="Wakeup Request Enable. Enables the MCANSS to wakeup on CAN RXD activity.
  0  Disable wakeup request
  1  Enables wakeup request" begin="4" end="4" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="AUTOWAKEUP" description="Automatic Wakeup Enable. Enables the MCANSS to automatically clear the MCAN CCCR.INIT bit, fully waking the MCAN up, on an enabled wakeup request.
  0  Disable the automatic write to CCCR.INIT
  1  Enable the automatic write to CCCR.INIT" begin="5" end="5" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="EXT_TS_CNTR_EN" description="External Timestamp Counter Enable.
  0  External timestamp counter disabled
  1  External timestamp counter enabled" begin="6" end="6" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANSS_STAT" width="32" offset="0x8" description="MCAN Subsystem Status Register">
                    <bitfield id="RESET" description="Soft Reset Status.
  0  Not in reset
  1  Reset is in progress" begin="0" end="0" width="1" rwaccess="R">
                    </bitfield>
                    <bitfield id="MEM_INIT_DONE" description="Memory Initialization Done.
  0  Message RAM initialization is in progress
  1  Message RAM is initialized for use" begin="1" end="1" width="1" rwaccess="R">
                    </bitfield>
                    <bitfield id="ENABLE_FDOE" description="Flexible Datarate Operation Enable. Determines whether CAN FD operation may be enabled via the MCAN core CCCR.FDOE bit (bit 8) or if only standard CAN operation is possible with this instance of the MCAN.
  0  MCAN is only capable of standard CAN communication
  1  MCAN may be configured to perform CAN FD communication" begin="2" end="2" width="1" rwaccess="R">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANSS_ICS" width="32" offset="0xC" description="MCAN Subsystem Interrupt Clear Shadow Register">
                    <bitfield id="EXT_TS_CNTR_OVFL" description="External Timestamp Counter Overflow Interrupt Status Clear. Reads always return a 0.
  0  Write of '0' has no effect
  1  Write of '1' clears the MCANSS_IRS.EXT_TS_CNTR_OVFL bit" begin="0" end="0" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANSS_IRS" width="32" offset="0x10" description="MCAN Subsystem Interrupt Raw Satus Register">
                    <bitfield id="EXT_TS_CNTR_OVFL" description="External Timestamp Counter Overflow Interrupt Status. This bit is set by HW or by a SW write of '1'. To clear, use the MCANSS_ICS.EXT_TS_CNTR_OVFL bit.
  0  External timestamp counter has not overflowed
  1  External timestamp counter has overflowed
 
When this bit is set to '1' by HW or SW, the MCANSS_EXT_TS_UNSERVICED_INTR_CNTR.EXT_TS_INTR_CNTR bit field will increment by 1." begin="0" end="0" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANSS_IECS" width="32" offset="0x14" description="MCAN Subsystem Interrupt Enable Clear Shadow Register">
                    <bitfield id="EXT_TS_CNTR_OVFL" description="External Timestamp Counter Overflow Interrupt Enable Clear. Reads always return a 0.
  0  Write of '0' has no effect
  1  Write of '1' clears the MCANSS_IES.EXT_TS_CNTR_OVFL bit" begin="0" end="0" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANSS_IE" width="32" offset="0x18" description="MCAN Subsystem Interrupt Enable Register">
                    <bitfield id="EXT_TS_CNTR_OVFL" description="External Timestamp Counter Overflow Interrupt Enable. A write of '0' has no effect. A write of '1' sets the MCANSS_IES.EXT_TS_CNTR_OVFL bit." begin="0" end="0" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANSS_IES" width="32" offset="0x1C" description="MCAN Subsystem Interrupt Enable Status">
                    <bitfield id="EXT_TS_CNTR_OVFL" description="External Timestamp Counter Overflow Interrupt Enable Status. To set, use the CANSS_IE.EXT_TS_CNTR_OVFL bit. To clear, use the MCANSS_IECS.EXT_TS_CNTR_OVFL bit.
  0  External timestamp counter overflow interrupt is not enabled
  1  External timestamp counter overflow interrupt is enabled" begin="0" end="0" width="1" rwaccess="R">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANSS_EOI" width="32" offset="0x20" description="MCAN Subsystem End of Interrupt">
                    <bitfield id="EOI" description="End of Interrupt. A write to this register will clear the associated interrupt. If the unserviced interrupt counter is &gt; 1, another interrupt is generated.
  0x00  External TS Interrupt is cleared
  0x01  MCAN(0) interrupt is cleared
  0x02  MCAN(1) interrupt is cleared
  Other writes are ignored." begin="7" end="0" width="8" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANSS_EXT_TS_PRESCALER" width="32" offset="0x24" description="MCAN Subsystem External Timestamp Prescaler 0">
                    <bitfield id="PRESCALER" description="External Timestamp Prescaler Reload Value. The external timestamp count rate is the host (system) clock rate divided by this value, except in the case of 0. A zero value in this bit field will act identically to a value of 0x000001." begin="23" end="0" width="24" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANSS_EXT_TS_UNSERVICED_INTR_CNTR" width="32" offset="0x28" description="MCAN Subsystem External Timestamp Unserviced Interrupts Counter">
                    <bitfield id="EXT_TS_INTR_CNTR" description="External Timestamp Counter Unserviced Rollover Interrupts. If this value is &gt; 1, an MCANSS_EOI write of '1' to bit 0 will issue another interrupt.
 
The status of this bit field is affected by the MCANSS_IRS.EXT_TS_CNTR_OVFL bit field." begin="4" end="0" width="5" rwaccess="R">
                    </bitfield>
                </register>
