IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0g1x0x_g3x0x/CANFD0_1.0.xml
Note that a write to the  MCANERR_ERR_STAT1.CLR_ECC_SEC goes through the SVBUS and has a delayed completion. To avoid an additional interrupt, read the MCANERR_ERR_STAT1 register back prior to writing to this bit field." begin="0" end="0" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANERR_SEC_STATUS" width="32" offset="0x40" description="MCAN Single Error Corrected Interrupt Status Register">
                    <bitfield id="MSGMEM_PEND" description="Message RAM SEC Interrupt Pending
  0  No SEC interrupt is pending
  1  SEC interrupt is pending" begin="0" end="0" width="1" rwaccess="R">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANERR_SEC_ENABLE_SET" width="32" offset="0x80" description="MCAN Single Error Corrected Interrupt Enable Set Register">
                    <bitfield id="MSGMEM_ENABLE_SET" description="Message RAM SEC Interrupt Pending Enable Set. Writing a 1 to this bit enables the Message RAM SEC error interrupts. Writing a 0 has no effect. Reads return the corresponding enable bit's current value." begin="0" end="0" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANERR_SEC_ENABLE_CLR" width="32" offset="0xC0" description="MCAN Single Error Corrected Interrupt Enable Clear Register">
                    <bitfield id="MSGMEM_ENABLE_CLR" description="Message RAM SEC Interrupt Pending Enable Clear. Writing a 1 to this bit disables the Message RAM SEC error interrupts. Writing a 0 has no effect. Reads return the corresponding enable bit's current value." begin="0" end="0" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANERR_DED_EOI" width="32" offset="0x13C" description="MCAN Double Error Detected End of Interrupt Register">
                    <bitfield id="EOI_WR" description="Write to this register indicates that software has acknowledged the pending interrupt and the next interrupt can be sent to the host.
 
Note that a write to the  MCANERR_ERR_STAT1.CLR_ECC_DED goes through the SVBUS and has a delayed completion. To avoid an additional interrupt, read the MCANERR_ERR_STAT1 register back prior to writing to this bit field." begin="0" end="0" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANERR_DED_STATUS" width="32" offset="0x140" description="MCAN Double Error Detected Interrupt Status Register">
                    <bitfield id="MSGMEM_PEND" description="Message RAM DED Interrupt Pending
  0  No DED interrupt is pending
  1  DED interrupt is pending" begin="0" end="0" width="1" rwaccess="R">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANERR_DED_ENABLE_SET" width="32" offset="0x180" description="MCAN Double Error Detected Interrupt Enable Set Register">
                    <bitfield id="MSGMEM_ENABLE_SET" description="Message RAM DED Interrupt Pending Enable Set. Writing a 1 to this bit enables the Message RAM DED error interrupts. Writing a 0 has no effect. Reads return the corresponding enable bit's current value." begin="0" end="0" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANERR_DED_ENABLE_CLR" width="32" offset="0x1C0" description="MCAN Double Error Detected Interrupt Enable Clear Register">
                    <bitfield id="MSGMEM_ENABLE_CLR" description="Message RAM DED Interrupt Pending Enable Clear. Writing a 1 to this bit disables the Message RAM DED error interrupts. Writing a 0 has no effect. Reads return the corresponding enable bit's current value." begin="0" end="0" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANERR_AGGR_ENABLE_SET" width="32" offset="0x200" description="MCAN Error Aggregator Enable Set Register">
                    <bitfield id="ENABLE_PARITY_SET" description="Write 1 to enable parity errors. Reads return the corresponding enable bit's current value." begin="0" end="0" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="ENABLE_TIMEOUT_SET" description="Write 1 to enable timeout errors. Reads return the corresponding enable bit's current value." begin="1" end="1" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANERR_AGGR_ENABLE_CLR" width="32" offset="0x204" description="MCAN Error Aggregator Enable Clear Register">
                    <bitfield id="ENABLE_PARITY_CLR" description="Write 1 to disable parity errors. Reads return the corresponding enable bit's current value." begin="0" end="0" width="1" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="ENABLE_TIMEOUT_CLR" description="Write 1 to disable timeout errors. Reads return the corresponding enable bit's current value." begin="1" end="1" width="1" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANERR_AGGR_STATUS_SET" width="32" offset="0x208" description="MCAN Error Aggregator Status Set Register">
                    <bitfield id="AGGR_PARITY_ERR" description="Aggregator Parity Error Status
 
2-bit saturating counter of the number of parity errors that have occurred since last cleared.
  0  No parity errors have occurred
  1  One parity error has occurred
  2  Two parity errors have occurred
  3  Three parity errors have occurred
 
A write of a non-zero value to this bit field increments it by the value provided." begin="1" end="0" width="2" rwaccess="R/W">
                    </bitfield>
                    <bitfield id="SVBUS_TIMEOUT" description="Aggregator Serial VBUS Timeout Error Status
 
2-bit saturating counter of the number of SVBUS timeout errors that have occurred since last cleared.
  0  No timeout errors have occurred
  1  One timeout error has occurred
  2  Two timeout errors have occurred
  3  Three timeout errors have occurred
 
A write of a non-zero value to this bit field increments it by the value provided." begin="3" end="2" width="2" rwaccess="R/W">
                    </bitfield>
                </register>
                <register id="CANFD0_MCANERR_AGGR_STATUS_CLR" width="32" offset="0x20C" description="MCAN Error Aggregator Status Clear Register">
                    <bitfield id="AGGR_PARITY_ERR" description="Aggregator Parity Error Status
 
2-bit saturating counter of the number of parity errors that have occurred since last cleared.
  0  No parity errors have occurred
  1  One parity error has occurred
  2  Two parity errors have occurred
  3  Three parity errors have occurred
 
